a = int(input())
# a = 5   # для теста

# крылечко
for i in range(a + 1):
    print('*' * i)
#
# обратное крылечко
for i in range(1, a+1):
    print(' ' * (a - i) + '*' * i)
#
# перевернутое крылечко
for i in range(a, 0, -1):
    print('*' * i)
#
# перевернутое обратное крылечко
for i in range(a, 0, -1):
    print(' ' * (a - i) + '*' * i)
#
# пирамида (при задании количества ступенек)
for i in range(1, a + 1):
    print(' ' * (a - i) + '*' * i + '*' * (i - 1))
#
# обратная пирамида (при задании количества ступенек)
for i in range(a, 0, -1):
    print(' ' * (a - i) + '*' * i + '*' * (i - 1))

# ромбик (при задании количества ступенек от верхушки до центра)
for i in range(1, a + 1):
    print(' ' * (a - i) + '*' * i + '*' * (i - 1))
for i in range(a - 1, 0, -1):
    print(' ' * (a - i) + '*' * i + '*' * (i - 1))
